---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecEditCircuitNamingSettingsParam
source: html/7ede30df-461f-aab5-1df8-e04aae4b4635.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecEditCircuitNamingSettingsParam Property

"Circuit Naming Settings"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecEditCircuitNamingSettingsParam { get; }
```